---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.OtherNonEditJoinFailure
source: html/46d3f775-5c77-c8aa-250f-3a003aa2819f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.OtherNonEditJoinFailure Property

Two elements were not automatically joined because other elements at join are not editable.

## Syntax (C#)
```csharp
public static FailureDefinitionId OtherNonEditJoinFailure { get; }
```